{
    "format": "layers-model",
    "generatedBy": "keras v3.10.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.10.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_2",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                30,
                                2
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_layer_2"
                        }
                    },
                    {
                        "class_name": "Bidirectional",
                        "config": {
                            "name": "bidirectional",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "merge_mode": "concat",
                            "layer": {
                                "module": "keras.layers",
                                "class_name": "LSTM",
                                "config": {
                                    "name": "forward_lstm_4",
                                    "trainable": true,
                                    "dtype": {
                                        "module": "keras",
                                        "class_name": "DTypePolicy",
                                        "config": {
                                            "name": "float32"
                                        },
                                        "registered_name": null
                                    },
                                    "return_sequences": true,
                                    "return_state": false,
                                    "go_backwards": false,
                                    "stateful": false,
                                    "unroll": false,
                                    "zero_output_for_mask": true,
                                    "units": 128,
                                    "activation": "tanh",
                                    "recurrent_activation": "sigmoid",
                                    "use_bias": true,
                                    "kernel_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "GlorotUniform",
                                        "config": {
                                            "seed": null
                                        },
                                        "registered_name": null
                                    },
                                    "recurrent_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "Orthogonal",
                                        "config": {
                                            "seed": null,
                                            "gain": 1.0
                                        },
                                        "registered_name": null
                                    },
                                    "bias_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "Zeros",
                                        "config": {},
                                        "registered_name": null
                                    },
                                    "unit_forget_bias": true,
                                    "kernel_regularizer": null,
                                    "recurrent_regularizer": null,
                                    "bias_regularizer": null,
                                    "activity_regularizer": null,
                                    "kernel_constraint": null,
                                    "recurrent_constraint": null,
                                    "bias_constraint": null,
                                    "dropout": 0.0,
                                    "recurrent_dropout": 0.0,
                                    "seed": null
                                },
                                "registered_name": null,
                                "build_config": {
                                    "input_shape": [
                                        null,
                                        30,
                                        2
                                    ]
                                }
                            },
                            "backward_layer": {
                                "module": "keras.layers",
                                "class_name": "LSTM",
                                "config": {
                                    "name": "backward_lstm_4",
                                    "trainable": true,
                                    "dtype": {
                                        "module": "keras",
                                        "class_name": "DTypePolicy",
                                        "config": {
                                            "name": "float32"
                                        },
                                        "registered_name": null
                                    },
                                    "return_sequences": true,
                                    "return_state": false,
                                    "go_backwards": true,
                                    "stateful": false,
                                    "unroll": false,
                                    "zero_output_for_mask": true,
                                    "units": 128,
                                    "activation": "tanh",
                                    "recurrent_activation": "sigmoid",
                                    "use_bias": true,
                                    "kernel_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "GlorotUniform",
                                        "config": {
                                            "seed": null
                                        },
                                        "registered_name": null
                                    },
                                    "recurrent_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "Orthogonal",
                                        "config": {
                                            "seed": null,
                                            "gain": 1.0
                                        },
                                        "registered_name": null
                                    },
                                    "bias_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "Zeros",
                                        "config": {},
                                        "registered_name": null
                                    },
                                    "unit_forget_bias": true,
                                    "kernel_regularizer": null,
                                    "recurrent_regularizer": null,
                                    "bias_regularizer": null,
                                    "activity_regularizer": null,
                                    "kernel_constraint": null,
                                    "recurrent_constraint": null,
                                    "bias_constraint": null,
                                    "dropout": 0.0,
                                    "recurrent_dropout": 0.0,
                                    "seed": null
                                },
                                "registered_name": null,
                                "build_config": {
                                    "input_shape": [
                                        null,
                                        30,
                                        2
                                    ]
                                }
                            }
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_4",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.3,
                            "seed": null,
                            "noise_shape": null
                        }
                    },
                    {
                        "class_name": "LSTM",
                        "config": {
                            "name": "lstm_5",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "return_sequences": false,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "zero_output_for_mask": false,
                            "units": 64,
                            "activation": "tanh",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "recurrent_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Orthogonal",
                                "config": {
                                    "seed": null,
                                    "gain": 1.0
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.0,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_5",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.3,
                            "seed": null,
                            "noise_shape": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_2",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 32,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_6",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.1,
                            "seed": null,
                            "noise_shape": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_3",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 1,
                            "activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ],
                "build_input_shape": [
                    null,
                    30,
                    2
                ]
            }
        },
        "training_config": {
            "loss": "binary_crossentropy",
            "loss_weights": null,
            "metrics": [
                "accuracy"
            ],
            "weighted_metrics": null,
            "run_eagerly": false,
            "steps_per_execution": 1,
            "jit_compile": false,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "adam",
                    "learning_rate": 0.0001250000059371814,
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "loss_scale_factor": null,
                    "gradient_accumulation_steps": null,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "batch_normalization/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization/moving_mean",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization/moving_variance",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/beta",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/moving_mean",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_1/moving_variance",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional/forward_lstm_4/kernel",
                    "shape": [
                        2,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional/forward_lstm_4/recurrent_kernel",
                    "shape": [
                        128,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional/forward_lstm_4/bias",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional/backward_lstm_4/kernel",
                    "shape": [
                        2,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional/backward_lstm_4/recurrent_kernel",
                    "shape": [
                        128,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "bidirectional/backward_lstm_4/bias",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_2/kernel",
                    "shape": [
                        64,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_2/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_3/kernel",
                    "shape": [
                        32,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_3/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_5/kernel",
                    "shape": [
                        256,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_5/recurrent_kernel",
                    "shape": [
                        64,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_5/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}